# GetDimensionValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..GetDimensionValue Method
FabricationPart Class See Also
---
Gets the value of the fabrication dimension, returns value in Revit internal units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double GetDimensionValue(
	FabricationDimensionDefinition dim
)
```

Visual Basic
---
```text
Public Function GetDimensionValue ( _
	dim As FabricationDimensionDefinition _
) As Double
```

Visual C++
---
```text
public:
double GetDimensionValue(
	FabricationDimensionDefinition^ dim
)
```

# ### Parameters
dim
    Type: Autodesk.Revit.DB..::..FabricationDimensionDefinition The fabrication dimension.
# ### Return Value
The dimension value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace